In [31]:
import pandas as pd

In [36]:
staff = pd.DataFrame({"Staff" : ["Mary", "John", "Peter"],
                      "City": ["London", "Paris", "Madrid"]})

In [33]:
staff

   Staff    City
0   Mary  London
1   John   Paris
2  Peter  Madrid

In [34]:
salaries = pd.DataFrame({"City": ["London", "Paris", "Sydney"],
                          "AvgSalary" : [10000, 20000, 30000]})

        AvgSalary
City
London      10000
Paris       20000
Sydney      30000

In [35]:
pd.concat([staff, salaries])

   Staff    City  AvgSalary
0   Mary  London        NaN
1   John   Paris        NaN
2  Peter  Madrid        NaN
0    NaN  London    10000.0
1    NaN   Paris    20000.0
2    NaN  Sydney    30000.0

In [37]:
staff.join(salaries)

ValueError: columns overlap but no suffix specified: Index(['City'], dtype='object')

In [41]:
pd.merge(staff, salaries, how="inner")

  Staff    City  AvgSalary
0  Mary  London      10000
1  John   Paris      20000

In [42]:
pd.merge(staff, salaries, how="left")

   Staff    City  AvgSalary
0   Mary  London    10000.0
1   John   Paris    20000.0
2  Peter  Madrid        NaN

In [43]:
pd.merge(staff, salaries, how="right")

  Staff    City  AvgSalary
0  Mary  London      10000
1  John   Paris      20000
2   NaN  Sydney      30000

In [44]:
pd.merge(staff, salaries, how="outer")

   Staff    City  AvgSalary
0   Mary  London    10000.0
1   John   Paris    20000.0
2  Peter  Madrid        NaN
3    NaN  Sydney    30000.0